sai14karthik/ESP32-Experiments-/firmware/CameraWebServerWiFiSense/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

static esp_err_t mic_handler(httpd_req_t *req) {
  float rms_db = -80.0f;
  float peak = 0.0f;
  sense_mic_get(&rms_db, &peak);
  char body[128];
  int n = snprintf(
    body,
    sizeof(body),
    "{\"ok\":%s,\"rms_db\":%.1f,\"peak\":%.4f}\n",
    sense_mic_ok() ? "true" : "false",
    rms_db,
    peak
  );
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  return httpd_resp_send(req, body, n > 0 ? n : 0);
}

// One live PCM client at a time (same idea as MJPEG stream kick).
static volatile uint32_t s_audio_id = 0;
static volatile int s_audio_sock = -1;
static httpd_handle_t s_audio_handle = NULL;

static void audio_kick_previous(httpd_req_t *req) {
  int new_fd = httpd_req_to_sockfd(req);
  int old_fd = s_audio_sock;
  s_audio_id++;
  if (old_fd >= 0 && old_fd != new_fd && s_audio_handle) {
    httpd_sess_trigger_close(s_audio_handle, old_fd);
  }
  s_audio_sock = new_fd;
  s_audio_handle = req->handle;
}

/** Continuous raw s16le mono @ 16 kHz for Mini ffmpeg (`-f s16le -ar 16000 -ac 1`). */
static esp_err_t audio_handler(httpd_req_t *req) {
  if (!sense_mic_ok()) {
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "mic not ready");
    return ESP_FAIL;
  }

  audio_kick_previous(req);
  const uint32_t my_id = s_audio_id;
  const int my_fd = httpd_req_to_sockfd(req);

  esp_err_t res = httpd_resp_set_type(req, "application/octet-stream");
  if (res != ESP_OK) {
    return res;
  }
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  httpd_resp_set_hdr(req, "X-Audio-Format", "s16le");
  httpd_resp_set_hdr(req, "X-Audio-Rate", "16000");
  httpd_resp_set_hdr(req, "X-Audio-Channels", "1");

  // ~40 ms chunks @ 16 kHz — always full size (pad silence) so ffmpeg never sees gaps → clicks.
  static const size_t CHUNK_SAMPLES = 640;
  int16_t buf[CHUNK_SAMPLES];

  while (my_id == s_audio_id && my_fd == s_audio_sock) {
    size_t n = sense_mic_read(buf, CHUNK_SAMPLES, 80);
    if (n < CHUNK_SAMPLES) {
      memset(buf + n, 0, (CHUNK_SAMPLES - n) * sizeof(int16_t));
    }
    res = httpd_resp_send_chunk(
      req, reinterpret_cast<const char *>(buf), CHUNK_SAMPLES * sizeof(int16_t)
    );
    if (res != ESP_OK) {
      break;
    }
  }

  if (s_audio_sock == my_fd) {
    s_audio_sock = -1;
  }
  httpd_resp_send_chunk(req, NULL, 0);
  return res;
}

void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 20;
  config.lru_purge_enable = true;

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t status_uri = {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

